damBreakOverPrism/2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       9420;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       9460;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          9600;
        startFace       9500;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       19100;
    }
    prism
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       19220;
    }
    atmosphere
    {
        type            patch;
        nFaces          120;
        startFace       19260;
    }
)

// ************************************************************************* //
