damBreakOverPrism/2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0;

vertices
(
    (0      0       0)      // 0
    (1      0       0)      // 1
    (2      1       0)      // 2
    (0      1       0)      // 3
    (0      0       1)      // 4
    (1      0       1)      // 5
    (2      1       1)      // 6
    (0      1       1)      // 7
    (0      2       0)      // 8
    (2      2       0)      // 9
    (0      2       1)      // 10
    (2      2       1)      // 11
    (3      0       0)      // 12
    (3      0       1)      // 13
    (6      0       0)      // 14
    (6      0       1)      // 15
    (6      1       0)      // 16
    (6      1       1)      // 17
    (6      2       0)      // 18
    (6      2       1)      // 19


);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 20 1) simpleGrading (1 1 1)
    hex (3 2 9 8 7 6 11 10) (40 20 1) simpleGrading (1 1 1)
    hex (12 14 16 2 13 15 17 6) (80 20 1) simpleGrading (1 1 1)
    hex (2 16 18 9 6 17 19 11) (80 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftWall
    {
        type wall;
        faces
        (
            (4 0 3 7)
            (7 3 8 10)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (17 16 14 15)
            (17 19 18 16)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (7 6 11 10)
            (0 1 2 3)
            (3 2 8 9)
            (13 15 17 6)
            (12 14 16 2)
            (6 17 19 11)
            (2 16 18 9)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (12 14 15 13)
        );
    }
    prism
    {
        type wall;
        faces
        (
            (1 2 6 5)
            (6 2 12 13)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (10 11 9 8)
            (11 19 18 9)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
